nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT798S
package_id: MIMXRT798SGVKB
mcu_data: ksdk2_0
processor_version: 0.2606.60
board: FRDM-IMXRT700
pin_labels:
- {pin_num: T24, pin_signal: PIO0_2/LP_FLEXCOMM8_P4/SCT0_GPIN2/SCT0_OUT2/CTIMER0_MAT1/SAI0_RX_DATA/LP_FLEXCOMM9_P0, label: 'U82E[D24]/U29[D2]', identifier: 'SAI0_RXD[0];SAI0_RXD0'}
- {pin_num: V25, pin_signal: PIO0_4/LP_FLEXCOMM4_P1/SCT0_GPIN4/SCT0_OUT4/CTIMER0_MAT3/SAI0_TX_DATA, label: 'U82E[V25]/U29[D1]', identifier: 'SAI0_TXD[0];SAI0_TXD0'}
- {pin_num: V23, pin_signal: PIO0_10/LP_FLEXCOMM5_P0/SCT0_GPIN4/SCT0_OUT4/CTIMER1_MAT0/CTIMER_C_INP0/SAI2_RX_DATA, label: SW5, identifier: SW5}
- {pin_num: V24, pin_signal: PIO0_14/LP_FLEXCOMM5_P4/SCT0_GPIN0/SCT0_OUT8/CTIMER_C_INP2/SAI2_RX_DATA/CLKOUT_VDD2, label: 'U82E[V24]/U68A[59]', identifier: 'SAI2_RXD[0];SAI2_RXD0'}
- {pin_num: AB24, pin_signal: PIO0_19/LP_FLEXCOMM6_P2/SCT0_GPIN2/SCT0_OUT2/CTIMER2_MAT2/SAI1_RX_SYNC, label: LED_BLU, identifier: LED_BLU}
- {pin_num: AB25, pin_signal: PIO0_21/LP_FLEXCOMM6_P0/SCT0_GPIN6/SCT0_OUT6/CTIMER_C_INP4/SAI1_TX_DATA/CLKCTL0_MCLK, label: MCLK, identifier: MCLK}
- {pin_num: AC22, pin_signal: PIO1_9/LP_FLEXCOMM1_P2/SCT0_GPIN7/SCT0_OUT3/CTIMER_C_INP15/CLKCTL0_CLKIN/CLKOUT_VDD1, label: LED_BLUE, identifier: LED_BLUE}
- {pin_num: AD22, pin_signal: PIO1_11/LP_FLEXCOMM2_P0/CTIMER2_MAT2/SWD_TRACEDATA0, label: BT_UART_RXD, identifier: BT_UART_RXD}
- {pin_num: AE22, pin_signal: PIO1_12/LP_FLEXCOMM2_P1/SCT0_GPIN3/SCT0_OUT9/CTIMER1_MAT1/SWD_TRACEDATA1, label: BT_UART_TXD, identifier: BT_UART_TXD}
- {pin_num: AD23, pin_signal: PIO1_13/LP_FLEXCOMM2_P4/UTICK0_CAP1/CTIMER2_MAT3/SWD_TRACEDATA2/32KHZ_CLKOUT, label: LED_GRN, identifier: LED_GRN}
- {pin_num: AE24, pin_signal: PIO1_14/LP_FLEXCOMM2_P2/CTIMER3_MAT0/SWD_TRACEDATA3, label: BT_UART_RTS, identifier: BT_UART_RTS}
- {pin_num: Y21, pin_signal: PIO1_15/LP_FLEXCOMM2_P3/CTIMER3_MAT1/CLKCTL0_CLKIN, label: BT_UART_CTS, identifier: BT_UART_CTS}
- {pin_num: B14, pin_signal: PIO4_11/XSPI2_SCLK0_N/LP_FLEXCOMM9_P4/XSPI2_SS1_N, label: PDN, identifier: PDN}
- {pin_num: C21, pin_signal: PIO7_3/SDHC0_DATA5/LP_FLEXCOMM12_P1, label: SD_VSELECT, identifier: SD_VSELECT}
- {pin_num: A24, pin_signal: PIO7_10/SDHC0_WR_PRT/LP_FLEXCOMM1_P0/SDHC0_DS, label: SD_PWREN_B, identifier: SD_;SD_PWR_EN_B;SD_PWREN_B}
- {pin_num: F18, pin_signal: PIO7_11/SDHC0_CARD_DET_N/LP_FLEXCOMM1_P1, label: SD_CARD_DET_N, identifier: SDHC0_CARD_DET_N;SDH_CARD_DET_N;SD_CARD_DET_N}
- {pin_num: A2, pin_signal: PIO6_9/XSPI0_DATA5/LP_FLEXCOMM13_P1/LP_FLEXCOMM11_P3, label: WL_RST, identifier: WL_RST}
- {pin_num: AA8, pin_signal: PIO8_6/LP_FLEXCOMM17_P1/CTIMER6_MATCH0/CMP0_OUT, label: PWM_RED, identifier: PWM_RED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: V21, peripheral: LP_FLEXCOMM0, signal: P0, pin_signal: PIO0_31/LP_FLEXCOMM0_P0/UTICK0_CAP2/SCT0_OUT8/CTIMER4_MAT0, input_buffer: enable}
  - {pin_num: AD25, peripheral: LP_FLEXCOMM0, signal: P1, pin_signal: PIO1_0/LP_FLEXCOMM0_P1/SCT0_OUT9/CTIMER4_MAT1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t RT_P0_31_FC0_RXD = (/* Pin is configured as LP_FLEXCOMM0_P0 */
                                       IOPCTL_PIO_FUNC1 |
                                       /* Disable pull-up / pull-down function */
                                       IOPCTL_PIO_PUPD_DI |
                                       /* Enable pull-down function */
                                       IOPCTL_PIO_PULLDOWN_EN |
                                       /* Enables input buffer function */
                                       IOPCTL_PIO_INBUF_EN |
                                       /* Pseudo Output Drain is disabled */
                                       IOPCTL_PIO_PSEDRAIN_DI |
                                       /* Input function is not inverted */
                                       IOPCTL_PIO_INV_DI |
                                       /* Selects transmitter current drive 100ohm */
                                       IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN31 (coords: V21) is configured as LP_FLEXCOMM0_P0 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PORT, BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PIN, RT_P0_31_FC0_RXD);

    const uint32_t RT_P1_0_FC0_TXD = (/* Pin is configured as LP_FLEXCOMM0_P1 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Disable input buffer function */
                                      IOPCTL_PIO_INBUF_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI |
                                      /* Selects transmitter current drive 100ohm */
                                      IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN0 (coords: AD25) is configured as LP_FLEXCOMM0_P1 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PORT, BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PIN, RT_P1_0_FC0_TXD);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSDCardPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: C21, peripheral: GPIO7, signal: 'GPIO, 3', pin_signal: PIO7_3/SDHC0_DATA5/LP_FLEXCOMM12_P1}
  - {pin_num: B22, peripheral: USDHC0, signal: USDHC_CLK, pin_signal: PIO7_0/SDHC0_CLK/LP_FLEXCOMM3_P4/LP_FLEXCOMM7_P6, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: B20, peripheral: USDHC0, signal: USDHC_CMD, pin_signal: PIO7_1/SDHC0_CMD/LP_FLEXCOMM3_P5/LP_FLEXCOMM7_P5, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: A22, peripheral: USDHC0, signal: 'USDHC_DATA, 0', pin_signal: PIO7_6/SDHC0_DATA0/LP_FLEXCOMM12_P4, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: A20, peripheral: USDHC0, signal: 'USDHC_DATA, 1', pin_signal: PIO7_7/SDHC0_DATA1/LP_FLEXCOMM12_P5, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: B23, peripheral: USDHC0, signal: 'USDHC_DATA, 3', pin_signal: PIO7_9/SDHC0_DATA3/LP_FLEXCOMM3_P6/LP_FLEXCOMM7_P4, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: C22, peripheral: USDHC0, signal: 'USDHC_DATA, 2', pin_signal: PIO7_8/SDHC0_DATA2/LP_FLEXCOMM12_P6/LP_FLEXCOMM7_P3, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: A24, peripheral: GPIO7, signal: 'GPIO, 10', pin_signal: PIO7_10/SDHC0_WR_PRT/LP_FLEXCOMM1_P0/SDHC0_DS, identifier: SD_PWREN_B}
  - {pin_num: F18, peripheral: USDHC0, signal: USDHC_CARD_DET, pin_signal: PIO7_11/SDHC0_CARD_DET_N/LP_FLEXCOMM1_P1, identifier: SD_CARD_DET_N, input_buffer: enable,
    pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

