nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSDCardPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitSDCardPins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t SDHC0_CLK = (/* Pin is configured as SDHC0_CLK */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 33ohm */
                                IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN0 (coords: B22) is configured as SDHC0_CLK */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SDHC0_CLK_PORT, BOARD_INITSDCARDPINS_SDHC0_CLK_PIN, SDHC0_CLK);

    const uint32_t SDHC0_CMD = (/* Pin is configured as SDHC0_CMD */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 33ohm */
                                IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN1 (coords: B20) is configured as SDHC0_CMD */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SDHC0_CMD_PORT, BOARD_INITSDCARDPINS_SDHC0_CMD_PIN, SDHC0_CMD);

    const uint32_t SD_PWREN_B = (/* Pin is configured as PIO7_10 */
                                 IOPCTL_PIO_FUNC0 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Disable input buffer function */
                                 IOPCTL_PIO_INBUF_DI |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN10 (coords: A24) is configured as PIO7_10 */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SD_PWREN_B_PORT, BOARD_INITSDCARDPINS_SD_PWREN_B_PIN, SD_PWREN_B);

    const uint32_t SD_CARD_DET_N = (/* Pin is configured as SDHC0_CARD_DET_N */
                                    IOPCTL_PIO_FUNC1 |
                                    /* Enable pull-up / pull-down function */
                                    IOPCTL_PIO_PUPD_EN |
                                    /* Enable pull-up function */
                                    IOPCTL_PIO_PULLUP_EN |
                                    /* Enables input buffer function */
                                    IOPCTL_PIO_INBUF_EN |
                                    /* Pseudo Output Drain is disabled */
                                    IOPCTL_PIO_PSEDRAIN_DI |
                                    /* Input function is not inverted */
                                    IOPCTL_PIO_INV_DI |
                                    /* Selects transmitter current drive 100ohm */
                                    IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN11 (coords: F18) is configured as SDHC0_CARD_DET_N */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SD_CARD_DET_N_PORT, BOARD_INITSDCARDPINS_SD_CARD_DET_N_PIN, SD_CARD_DET_N);

    const uint32_t SD_VSELECT = (/* Pin is configured as PIO7_3 */
                                 IOPCTL_PIO_FUNC0 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Disable input buffer function */
                                 IOPCTL_PIO_INBUF_DI |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN3 (coords: C21) is configured as PIO7_3 */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SD_VSELECT_PORT, BOARD_INITSDCARDPINS_SD_VSELECT_PIN, SD_VSELECT);

    const uint32_t SDHC0_DATA0 = (/* Pin is configured as SDHC0_DATA0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 33ohm */
                                  IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN6 (coords: A22) is configured as SDHC0_DATA0 */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SDHC0_DATA0_PORT, BOARD_INITSDCARDPINS_SDHC0_DATA0_PIN, SDHC0_DATA0);

