nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
    const uint32_t XSPI2_DATA1_16 = (/* Pin is configured as XSPI2_DATA_A1 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN2 (coords: C10) is configured as XSPI2_DATA_A1 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA1_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA1_16_PIN, XSPI2_DATA1_16);

    const uint32_t XSPI2_DATA15_16 = (/* Pin is configured as XSPI2_DATA_A15 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI |
                                      /* Selects transmitter current drive 100ohm */
                                      IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN20 (coords: C18) is configured as XSPI2_DATA_A15 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PIN, XSPI2_DATA15_16);

    const uint32_t XSPI2_DATA2_16 = (/* Pin is configured as XSPI2_DATA_A2 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN3 (coords: B11) is configured as XSPI2_DATA_A2 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA2_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA2_16_PIN, XSPI2_DATA2_16);

    const uint32_t XSPI2_DATA3_16 = (/* Pin is configured as XSPI2_DATA_A3 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN4 (coords: A10) is configured as XSPI2_DATA_A3 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA3_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA3_16_PIN, XSPI2_DATA3_16);

    const uint32_t XSPI2_DQS0 = (/* Pin is configured as XSPI2_DQS_A_0 */
                                 IOPCTL_PIO_FUNC1 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Enables input buffer function */
                                 IOPCTL_PIO_INBUF_EN |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN5 (coords: A12) is configured as XSPI2_DQS_A_0 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DQS0_PORT, BOARD_INITXSPI2PINS_XSPI2_DQS0_PIN, XSPI2_DQS0);

    const uint32_t XSPI2_DATA4_16 = (/* Pin is configured as XSPI2_DATA_A4 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN6 (coords: C12) is configured as XSPI2_DATA_A4 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA4_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA4_16_PIN, XSPI2_DATA4_16);

    const uint32_t XSPI2_DATA5_16 = (/* Pin is configured as XSPI2_DATA_A5 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN7 (coords: B12) is configured as XSPI2_DATA_A5 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA5_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA5_16_PIN, XSPI2_DATA5_16);

    const uint32_t XSPI2_DATA6_16 = (/* Pin is configured as XSPI2_DATA_A6 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN8 (coords: C13) is configured as XSPI2_DATA_A6 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA6_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA6_16_PIN, XSPI2_DATA6_16);

