nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
    const uint32_t XSPI2_DATA7_16 = (/* Pin is configured as XSPI2_DATA_A7 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN9 (coords: A14) is configured as XSPI2_DATA_A7 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA7_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA7_16_PIN, XSPI2_DATA7_16);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPMICPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: AA14, peripheral: LPI2C15, signal: SCL, pin_signal: PMIC_I2C_SCL, open_drain: enable, input_buffer: enable}
  - {pin_num: Y14, peripheral: LPI2C15, signal: SDA, pin_signal: PMIC_I2C_SDA, open_drain: enable, input_buffer: enable}
  - {pin_num: V2, peripheral: GPIO7, signal: 'GPIO, 14', pin_signal: PIO7_14/SDHC1_DATA5/LP_FLEXCOMM7_P0}
  - {pin_num: V1, peripheral: GPIO7, signal: 'GPIO, 15', pin_signal: PIO7_15/SDHC1_DATA6/LP_FLEXCOMM7_P1}
  - {pin_num: T1, peripheral: GPIO7, signal: 'GPIO, 16', pin_signal: PIO7_16/SDHC1_DATA7/LP_FLEXCOMM7_P2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPMICPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPMICPins(void)
{
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    IOPCTL1->PMIC_I2C_SCL = ((IOPCTL1->PMIC_I2C_SCL &
                              /* Mask bits to zero which are setting */
                              (~(IOPCTL1_PMIC_I2C_SCL_IBENA_MASK | IOPCTL1_PMIC_I2C_SCL_ODENA_MASK)))

                             /* Input Buffer Enable: Enables */
                             | IOPCTL1_PMIC_I2C_SCL_IBENA(PMIC_I2C_SCL_IBENA_IBENA_1)

                             /* Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
                             | IOPCTL1_PMIC_I2C_SCL_ODENA(PMIC_I2C_SCL_ODENA_ODENA_1));

    IOPCTL1->PMIC_I2C_SDA = ((IOPCTL1->PMIC_I2C_SDA &
                              /* Mask bits to zero which are setting */
                              (~(IOPCTL1_PMIC_I2C_SDA_IBENA_MASK | IOPCTL1_PMIC_I2C_SDA_ODENA_MASK)))

                             /* Input Buffer Enable: Enables */
                             | IOPCTL1_PMIC_I2C_SDA_IBENA(PMIC_I2C_SDA_IBENA_IBENA_1)

                             /* Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
                             | IOPCTL1_PMIC_I2C_SDA_ODENA(PMIC_I2C_SDA_ODENA_ODENA_1));

    const uint32_t PMIC_DVS_CTRL0 = (/* Pin is configured as PIO7_14 */
                                     IOPCTL_PIO_FUNC0 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Disable input buffer function */
                                     IOPCTL_PIO_INBUF_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN14 (coords: V2) is configured as PIO7_14 */
    IOPCTL_PinMuxSet(BOARD_INITPMICPINS_PMIC_DVS_CTRL0_PORT, BOARD_INITPMICPINS_PMIC_DVS_CTRL0_PIN, PMIC_DVS_CTRL0);

    const uint32_t PMIC_DVS_CTRL1 = (/* Pin is configured as PIO7_15 */
                                     IOPCTL_PIO_FUNC0 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Disable input buffer function */
                                     IOPCTL_PIO_INBUF_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN15 (coords: V1) is configured as PIO7_15 */
    IOPCTL_PinMuxSet(BOARD_INITPMICPINS_PMIC_DVS_CTRL1_PORT, BOARD_INITPMICPINS_PMIC_DVS_CTRL1_PIN, PMIC_DVS_CTRL1);

    const uint32_t PMIC_DVS_CTRL2 = (/* Pin is configured as PIO7_16 */
                                     IOPCTL_PIO_FUNC0 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Disable input buffer function */
                                     IOPCTL_PIO_INBUF_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN16 (coords: T1) is configured as PIO7_16 */
    IOPCTL_PinMuxSet(BOARD_INITPMICPINS_PMIC_DVS_CTRL2_PORT, BOARD_INITPMICPINS_PMIC_DVS_CTRL2_PIN, PMIC_DVS_CTRL2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCMPPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: Y6, peripheral: ACMP0, signal: 'IN, 1', pin_signal: PIO10_8/PDM_CLK}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

