nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCMPPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitCMPPins(void)
{
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t DMIC_CLK = (/* Pin is configured as CMP0_INA */
                               IOPCTL_PIO_FUNC0 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Disable input buffer function */
                               IOPCTL_PIO_INBUF_DI |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is enabled */
                               IOPCTL_PIO_ANAMUX_EN |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT10 PIN8 (coords: Y6) is configured as CMP0_INA */
    IOPCTL_PinMuxSet(BOARD_INITCMPPINS_DMIC_CLK_PORT, BOARD_INITCMPPINS_DMIC_CLK_PIN, DMIC_CLK);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitVDD2_CLKOUTPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: V24, peripheral: CLKCTL0, signal: 'CLKOUT_VDD, 2', pin_signal: PIO0_14/LP_FLEXCOMM5_P4/SCT0_GPIN0/SCT0_OUT8/CTIMER_C_INP2/SAI2_RX_DATA/CLKOUT_VDD2,
    identifier: SAI2_RXD0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitVDD2_CLKOUTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitVDD2_CLKOUTPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t SAI2_RXD0 = (/* Pin is configured as CLKOUT_VDD2 */
                                IOPCTL_PIO_FUNC6 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Disable input buffer function */
                                IOPCTL_PIO_INBUF_DI |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN14 (coords: V24) is configured as CLKOUT_VDD2 */
    IOPCTL_PinMuxSet(BOARD_INITVDD2_CLKOUTPINS_SAI2_RXD0_PORT, BOARD_INITVDD2_CLKOUTPINS_SAI2_RXD0_PIN, SAI2_RXD0);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIO_I2CPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: P25, peripheral: FLEXIO, signal: 'IO, 0', pin_signal: PIO2_0/USB0_OVERCURRENTN/EZH_PIO0/FLEXIO_D0/LCD_DBI_CSX_AB, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: M23, peripheral: FLEXIO, signal: 'IO, 1', pin_signal: PIO2_1/USB0_PORTPWRN/EZH_PIO1/FLEXIO_D1/LCD_DBI_DCX_AB, input_buffer: enable, pull_select: up,
    pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_I2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitFLEXIO_I2CPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t FXIO_D0 = (/* Pin is configured as FLEXIO_D0 */
                              IOPCTL_PIO_FUNC5 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN0 (coords: P25) is configured as FLEXIO_D0 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_I2CPINS_FXIO_D0_PORT, BOARD_INITFLEXIO_I2CPINS_FXIO_D0_PIN, FXIO_D0);

    const uint32_t FXIO_D1 = (/* Pin is configured as FLEXIO_D1 */
                              IOPCTL_PIO_FUNC5 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN1 (coords: M23) is configured as FLEXIO_D1 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_I2CPINS_FXIO_D1_PORT, BOARD_INITFLEXIO_I2CPINS_FXIO_D1_PIN, FXIO_D1);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIO_UARTPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: P25, peripheral: FLEXIO, signal: 'IO, 0', pin_signal: PIO2_0/USB0_OVERCURRENTN/EZH_PIO0/FLEXIO_D0/LCD_DBI_CSX_AB, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: M23, peripheral: FLEXIO, signal: 'IO, 1', pin_signal: PIO2_1/USB0_PORTPWRN/EZH_PIO1/FLEXIO_D1/LCD_DBI_DCX_AB, input_buffer: enable, pull_select: up,
    pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

