nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitFLEXIO_UARTPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t FXIO_D0 = (/* Pin is configured as FLEXIO_D0 */
                              IOPCTL_PIO_FUNC5 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN0 (coords: P25) is configured as FLEXIO_D0 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_UARTPINS_FXIO_D0_PORT, BOARD_INITFLEXIO_UARTPINS_FXIO_D0_PIN, FXIO_D0);

    const uint32_t FXIO_D1 = (/* Pin is configured as FLEXIO_D1 */
                              IOPCTL_PIO_FUNC5 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN1 (coords: M23) is configured as FLEXIO_D1 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_UARTPINS_FXIO_D1_PORT, BOARD_INITFLEXIO_UARTPINS_FXIO_D1_PIN, FXIO_D1);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIO_PWMPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: K24, peripheral: FLEXIO, signal: 'IO, 7', pin_signal: PIO2_7/LPSPI16_PCS2/EZH_PIO7/FLEXIO_D7/LCD_D1/LCD_DBI_D1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_PWMPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitFLEXIO_PWMPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t FXIO_D7 = (/* Pin is configured as FLEXIO_D7 */
                              IOPCTL_PIO_FUNC5 |
                              /* Disable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_DI |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Disable input buffer function */
                              IOPCTL_PIO_INBUF_DI |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN7 (coords: K24) is configured as FLEXIO_D7 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_PWMPINS_FXIO_D7_PORT, BOARD_INITFLEXIO_PWMPINS_FXIO_D7_PIN, FXIO_D7);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIO_SPIPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: P25, peripheral: FLEXIO, signal: 'IO, 0', pin_signal: PIO2_0/USB0_OVERCURRENTN/EZH_PIO0/FLEXIO_D0/LCD_DBI_CSX_AB, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: M23, peripheral: FLEXIO, signal: 'IO, 1', pin_signal: PIO2_1/USB0_PORTPWRN/EZH_PIO1/FLEXIO_D1/LCD_DBI_DCX_AB, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: K22, peripheral: FLEXIO, signal: 'IO, 14', pin_signal: PIO2_14/EZH_PIO14/FLEXIO_D14/CLKCTL0_LOW_FREQ_CLKOUT, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: K21, peripheral: FLEXIO, signal: 'IO, 15', pin_signal: PIO2_15/EZH_PIO15/FLEXIO_D15/CLKCTL0_LOW_FREQ_CLKOUT_N, input_buffer: enable, pull_select: up,
    pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_SPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitFLEXIO_SPIPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t FXIO_D0 = (/* Pin is configured as FLEXIO_D0 */
                              IOPCTL_PIO_FUNC5 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN0 (coords: P25) is configured as FLEXIO_D0 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_SPIPINS_FXIO_D0_PORT, BOARD_INITFLEXIO_SPIPINS_FXIO_D0_PIN, FXIO_D0);

    const uint32_t FXIO_D1 = (/* Pin is configured as FLEXIO_D1 */
                              IOPCTL_PIO_FUNC5 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN1 (coords: M23) is configured as FLEXIO_D1 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_SPIPINS_FXIO_D1_PORT, BOARD_INITFLEXIO_SPIPINS_FXIO_D1_PIN, FXIO_D1);

    const uint32_t FXIO_D14 = (/* Pin is configured as FLEXIO_D14 */
                               IOPCTL_PIO_FUNC5 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-up function */
                               IOPCTL_PIO_PULLUP_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT2 PIN14 (coords: K22) is configured as FLEXIO_D14 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_SPIPINS_FXIO_D14_PORT, BOARD_INITFLEXIO_SPIPINS_FXIO_D14_PIN, FXIO_D14);

    const uint32_t FXIO_D15 = (/* Pin is configured as FLEXIO_D15 */
                               IOPCTL_PIO_FUNC5 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-up function */
                               IOPCTL_PIO_PULLUP_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT2 PIN15 (coords: K21) is configured as FLEXIO_D15 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_SPIPINS_FXIO_D15_PORT, BOARD_INITFLEXIO_SPIPINS_FXIO_D15_PIN, FXIO_D15);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: L24, peripheral: LPSPI16, signal: SCK, pin_signal: PIO2_3/LPSPI16_SCK/EZH_PIO3/FLEXIO_D3/LCD_DOTCLK/LCD_DBI_RWDX, input_buffer: enable}
  - {pin_num: M24, peripheral: LPSPI16, signal: SIN, pin_signal: PIO2_4/LPSPI16_SIN/EZH_PIO4/FLEXIO_D4/LCD_HSYNC/LCD_DBI_WRX, input_buffer: enable}
  - {pin_num: N23, peripheral: LPSPI16, signal: PCS0, pin_signal: PIO2_5/LPSPI16_PCS0/EZH_PIO5/FLEXIO_D5/LCD_VSYNC/LCD_DBI_E, input_buffer: enable}
  - {pin_num: P23, peripheral: LPSPI16, signal: SOUT, pin_signal: PIO2_2/LPSPI16_SOUT/EZH_PIO2/FLEXIO_D2/LCD_ENABLE/LCD_DBI_DATA_OEN, input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

