nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDMICPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitDMICPins(void)
{
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t DMIC_CLK = (/* Pin is configured as PDM_CLK */
                               IOPCTL_PIO_FUNC5 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Disable input buffer function */
                               IOPCTL_PIO_INBUF_DI |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT10 PIN8 (coords: Y6) is configured as PDM_CLK */
    IOPCTL_PinMuxSet(BOARD_INITDMICPINS_DMIC_CLK_PORT, BOARD_INITDMICPINS_DMIC_CLK_PIN, DMIC_CLK);

    const uint32_t DMIC_DATA01 = (/* Pin is configured as PDM_DATA01 */
                                  IOPCTL_PIO_FUNC5 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Normal mode */
                                  IOPCTL_PIO_SLEW_RATE_NORMAL |
                                  /* Analog mux is disabled */
                                  IOPCTL_PIO_ANAMUX_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI);
    /* PORT10 PIN9 (coords: Y5) is configured as PDM_DATA01 */
    IOPCTL_PinMuxSet(BOARD_INITDMICPINS_DMIC_DATA01_PORT, BOARD_INITDMICPINS_DMIC_DATA01_PIN, DMIC_DATA01);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSCTimerPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: P21, peripheral: SCT0, signal: 'OUT, 6', pin_signal: PIO0_6/LP_FLEXCOMM4_P2/SCT0_GPIN6/SCT0_OUT6/CTIMER_C_INP10/LP_FLEXCOMM8_P0}
  - {pin_num: P20, peripheral: SCT0, signal: 'OUT, 7', pin_signal: PIO0_7/LP_FLEXCOMM4_P3/SCT0_GPIN7/SCT0_OUT7/CTIMER_C_INP11/LP_FLEXCOMM8_P1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSCTimerPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitSCTimerPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t P0_6_I2C8_SDA_1V8 = (/* Pin is configured as SCT0_OUT6 */
                                        IOPCTL_PIO_FUNC3 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN6 (coords: P21) is configured as SCT0_OUT6 */
    IOPCTL_PinMuxSet(BOARD_INITSCTIMERPINS_P0_6_I2C8_SDA_1V8_PORT, BOARD_INITSCTIMERPINS_P0_6_I2C8_SDA_1V8_PIN, P0_6_I2C8_SDA_1V8);

    const uint32_t P0_7_I2C8_SCL_1V8 = (/* Pin is configured as SCT0_OUT7 */
                                        IOPCTL_PIO_FUNC3 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN7 (coords: P20) is configured as SCT0_OUT7 */
    IOPCTL_PinMuxSet(BOARD_INITSCTIMERPINS_P0_7_I2C8_SCL_1V8_PORT, BOARD_INITSCTIMERPINS_P0_7_I2C8_SCL_1V8_PIN, P0_7_I2C8_SCL_1V8);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBT_UARTPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: AD22, peripheral: LP_FLEXCOMM2, signal: P0, pin_signal: PIO1_11/LP_FLEXCOMM2_P0/CTIMER2_MAT2/SWD_TRACEDATA0, input_buffer: enable}
  - {pin_num: AE22, peripheral: LP_FLEXCOMM2, signal: P1, pin_signal: PIO1_12/LP_FLEXCOMM2_P1/SCT0_GPIN3/SCT0_OUT9/CTIMER1_MAT1/SWD_TRACEDATA1}
  - {pin_num: AE24, peripheral: LP_FLEXCOMM2, signal: P2, pin_signal: PIO1_14/LP_FLEXCOMM2_P2/CTIMER3_MAT0/SWD_TRACEDATA3, input_buffer: enable}
  - {pin_num: Y21, peripheral: LP_FLEXCOMM2, signal: P3, pin_signal: PIO1_15/LP_FLEXCOMM2_P3/CTIMER3_MAT1/CLKCTL0_CLKIN}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

