nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitWIFIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitWIFIPins(void)
{

    /* Enables the clock for the GPIO4 module */
    CLOCK_EnableClock(kCLOCK_Gpio4);

    /* Enables the clock for the GPIO6 module */
    CLOCK_EnableClock(kCLOCK_Gpio6);

    gpio_pin_config_t PDN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_11 (pin B14)  */
    GPIO_PinInit(BOARD_INITWIFIPINS_PDN_GPIO, BOARD_INITWIFIPINS_PDN_PIN, &PDN_config);

    gpio_pin_config_t WL_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO6_9 (pin A2)  */
    GPIO_PinInit(BOARD_INITWIFIPINS_WL_RST_GPIO, BOARD_INITWIFIPINS_WL_RST_PIN, &WL_RST_config);
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t PDN = (/* Pin is configured as PIO4_11 */
                          IOPCTL_PIO_FUNC0 |
                          /* Disable pull-up / pull-down function */
                          IOPCTL_PIO_PUPD_DI |
                          /* Enable pull-down function */
                          IOPCTL_PIO_PULLDOWN_EN |
                          /* Disable input buffer function */
                          IOPCTL_PIO_INBUF_DI |
                          /* Pseudo Output Drain is disabled */
                          IOPCTL_PIO_PSEDRAIN_DI |
                          /* Input function is not inverted */
                          IOPCTL_PIO_INV_DI |
                          /* Selects transmitter current drive 100ohm */
                          IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN11 (coords: B14) is configured as PIO4_11 */
    IOPCTL_PinMuxSet(BOARD_INITWIFIPINS_PDN_PORT, BOARD_INITWIFIPINS_PDN_PIN, PDN);

    const uint32_t WL_RST = (/* Pin is configured as PIO6_9 */
                             IOPCTL_PIO_FUNC0 |
                             /* Disable pull-up / pull-down function */
                             IOPCTL_PIO_PUPD_DI |
                             /* Enable pull-down function */
                             IOPCTL_PIO_PULLDOWN_EN |
                             /* Disable input buffer function */
                             IOPCTL_PIO_INBUF_DI |
                             /* Pseudo Output Drain is disabled */
                             IOPCTL_PIO_PSEDRAIN_DI |
                             /* Input function is not inverted */
                             IOPCTL_PIO_INV_DI |
                             /* Selects transmitter current drive 100ohm */
                             IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN9 (coords: A2) is configured as PIO6_9 */
    IOPCTL_PinMuxSet(BOARD_INITWIFIPINS_WL_RST_PORT, BOARD_INITWIFIPINS_WL_RST_PIN, WL_RST);

    const uint32_t SDHC1_CLK = (/* Pin is configured as SDHC1_CLK */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN17 (coords: U3) is configured as SDHC1_CLK */
    IOPCTL_PinMuxSet(BOARD_INITWIFIPINS_SDHC1_CLK_PORT, BOARD_INITWIFIPINS_SDHC1_CLK_PIN, SDHC1_CLK);

    const uint32_t SDHC1_CMD = (/* Pin is configured as SDHC1_CMD */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN18 (coords: T3) is configured as SDHC1_CMD */
    IOPCTL_PinMuxSet(BOARD_INITWIFIPINS_SDHC1_CMD_PORT, BOARD_INITWIFIPINS_SDHC1_CMD_PIN, SDHC1_CMD);

    const uint32_t SDHC1_DATA0 = (/* Pin is configured as SDHC1_DATA0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN19 (coords: V3) is configured as SDHC1_DATA0 */
    IOPCTL_PinMuxSet(BOARD_INITWIFIPINS_SDHC1_DATA0_PORT, BOARD_INITWIFIPINS_SDHC1_DATA0_PIN, SDHC1_DATA0);

    const uint32_t SDHC1_DATA1 = (/* Pin is configured as SDHC1_DATA1 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN20 (coords: Y2) is configured as SDHC1_DATA1 */
    IOPCTL_PinMuxSet(BOARD_INITWIFIPINS_SDHC1_DATA1_PORT, BOARD_INITWIFIPINS_SDHC1_DATA1_PIN, SDHC1_DATA1);

    const uint32_t SDHC1_DATA2 = (/* Pin is configured as SDHC1_DATA2 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN21 (coords: R2) is configured as SDHC1_DATA2 */
    IOPCTL_PinMuxSet(BOARD_INITWIFIPINS_SDHC1_DATA2_PORT, BOARD_INITWIFIPINS_SDHC1_DATA2_PIN, SDHC1_DATA2);

