nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
    const uint32_t FXIO_D12 = (/* Pin is configured as FLEXIO_D12 */
                               IOPCTL_PIO_FUNC5 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT2 PIN12 (coords: H24) is configured as FLEXIO_D12 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_CAMERAPINS_FXIO_D12_PORT, BOARD_INITFLEXIO_CAMERAPINS_FXIO_D12_PIN, FXIO_D12);

    const uint32_t FXIO_D13 = (/* Pin is configured as FLEXIO_D13 */
                               IOPCTL_PIO_FUNC5 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT2 PIN13 (coords: H23) is configured as FLEXIO_D13 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_CAMERAPINS_FXIO_D13_PORT, BOARD_INITFLEXIO_CAMERAPINS_FXIO_D13_PIN, FXIO_D13);

    const uint32_t FXIO_D15 = (/* Pin is configured as FLEXIO_D15 */
                               IOPCTL_PIO_FUNC5 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT2 PIN15 (coords: K21) is configured as FLEXIO_D15 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_CAMERAPINS_FXIO_D15_PORT, BOARD_INITFLEXIO_CAMERAPINS_FXIO_D15_PIN, FXIO_D15);

    const uint32_t port2_pin2_config = (/* Pin is configured as FLEXIO_D2 */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN2 (coords: P23) is configured as FLEXIO_D2 */
    IOPCTL_PinMuxSet(2U, 2U, port2_pin2_config);

    const uint32_t port2_pin5_config = (/* Pin is configured as PIO2_5 */
                                        IOPCTL_PIO_FUNC0 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN5 (coords: N23) is configured as PIO2_5 */
    IOPCTL_PinMuxSet(2U, 5U, port2_pin5_config);

    const uint32_t FXIO_D6 = (/* Pin is configured as FLEXIO_D6 */
                              IOPCTL_PIO_FUNC5 |
                              /* Disable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_DI |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN6 (coords: K25) is configured as FLEXIO_D6 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_CAMERAPINS_FXIO_D6_PORT, BOARD_INITFLEXIO_CAMERAPINS_FXIO_D6_PIN, FXIO_D6);

